import React from "react";
import '../styles/AboutUs.css';

const AboutMe = () => {
    return (
        <div className="about-us">
            <div className="about-us-content">
               <p>
                   Профессиональный профиль:
                   Опытный фронтенд-разработчик с фокусом на React. Занимаюсь разработкой современных и отзывчивых веб-приложений, обладающих высокой производительностью и интуитивно понятным пользовательским интерфейсом. Глубокие знания в области React, Redux, JavaScript, HTML и CSS.

                   Основные навыки:

                   Продвинутые знания React и его основных концепций, таких как компоненты, виртуальный DOM, JSX и жизненный цикл компонентов.
                   Опыт работы с управляемыми и неуправляемыми компонентами в React для эффективного управления состоянием приложения.
                   Понимание принципов работы Redux и опыт использования для управления состоянием приложения в больших проектах.
                   Знание современных паттернов проектирования, таких как контейнер-компоненты и компоненты высшего порядка (HOC).
                   Опыт работы с асинхронными запросами к API с использованием библиотеки Axios или встроенных средств Fetch API.
                   Глубокое понимание JavaScript, включая новые возможности ES6/ES7 и функциональное программирование.
                   Умение создавать адаптивные и кроссбраузерные веб-страницы с использованием HTML5 и CSS3, а также препроцессоров Sass или Less.
                   Знание современных инструментов разработки, таких как Webpack, Babel, ESLint и NPM для сборки и управления зависимостями проекта.
                   Опыт работы с системами контроля версий, такими как Git, и умение работать в команде с использованием GitFlow или подобных методологий.
                   Желание постоянно обучаться и следить за последними тенденциями во фронтенд-разработке.
                   Опыт работы:

                   Разработка и поддержка крупных веб-приложений на React с использованием Redux для управления состоянием (список проектов и их описания).
                   Интеграция сторонних API для получения данных и обновления интерфейса приложения в реальном времени.
                   Оптимизация производительности приложения и улучшение пользовательского опыта с помощью асинхронной загрузки данных, ленивой загрузки компонентов и код-сплиттинга.
                   Участие в ревью кода, работа в Agile-команде и совместное развитие архитектуры проекта для повышения масштабируемости и надежности.
               </p>
            </div>
        </div>
    );
};

export default AboutMe;
