import React from "react";
import '../styles/AboutUs.css';

const AboutMe = () => {
    return (
        <div className="about-us">
            <div className="about-us-content">
                <p>
                    Здравуствуйте! Меня зовут Дмитрий ,  Я - веб-разработчик с глубоким интересом к созданию инновационных и эффективных веб-приложений. Мой путь в программирование начался два года назад с изучения C#, где я погрузился в мир объектно-ориентированного программирования. Параллельно я также познакомился с языком Java, что дало мне ценный опыт работы с многопоточностью и разработкой масштабируемых приложений.
                </p>
                <p>
                    Однако, мое настоящее вдохновение я нашел в веб-разработке, и я решил сосредоточить свои усилия на изучении JavaScript. В течение последних двух лет я углубил свои знания в HTML и CSS, активно применяя препроцессоры стилей, такие как Sass и SCSS, а также фреймворки, включая Bootstrap и Tailwind. Мой опыт включает работу с инструментами сборки, такими как Babel и Webpack, что позволяет мне эффективно управлять проектами любого масштаба.
                </p>
                <p>
                    В настоящее время я фокусирую свое внимание на изучении React и Next.js, стремясь создавать динамичные и масштабируемые веб-приложения. Мой подход к разработке базируется на принципах чистого кода, модульности и лучших практиках отрасли.
                </p>
                <p>
                    В моей работе я ценю командную работу и стремлюсь к непрерывному саморазвитию. Я готов к новым вызовам и ищу возможность применить свои знания и навыки в качестве части творческой и инновационной команды. Я уверен, что могу внести свой вклад в создание веб-приложений, которые вдохновляют и улучшают жизнь пользователей.
                </p>
            </div>
        </div>
    );
};

export default AboutMe;
